:properties:
:header-args:sql:  :engine     postgresql
:header-args:sql+: :dbhost     "localhost"
:header-args:sql+: :database   "bits_dev"
:header-args:sql+: :dbuser     "bits"
:header-args:sql+: :dbpassword "please"
:end:
#+title:    PostgreSQL
#+startup:  content
#+property: header-args :dir ..

* Users
** Select all
#+begin_src sql
select
  u.id as user_id,
  e.address,
  e.valid_from,
  e.valid_to,
  u.created_at
from users u
join email_addresses e on e.user_id = u.id;
#+end_src

#+results:
| user_id | address              | valid_from                    | valid_to | created_at                    |
|---------+----------------------+-------------------------------+----------+-------------------------------|
|       1 | james@invetica.co.uk | 2025-12-05 16:07:01.366019+00 | infinity | 2025-12-05 16:07:01.364261+00 |
|       2 | a@a.a                | 2025-12-05 16:07:16.321656+00 | infinity | 2025-12-05 16:07:16.321656+00 |

** Delete others
#+begin_src sql :eval query
delete from users where id > 1;
#+end_src

#+results:
| DELETE 0 |
|----------|

** Logins view
#+begin_src sql
select user_id, email, verified from logins;
#+end_src

#+results:
| user_id | email                | verified |
|---------+----------------------+----------|
|       1 | james@invetica.co.uk | t        |

* Test databases
** Select databases
#+name: test-database-names
#+begin_src sql
select datname
from pg_database
where datname like 'bits_test_%';
#+end_src

#+results: test-database-names
| datname                                    |
|--------------------------------------------|
| bits_test_de521ad69a5c42f5a88a7b8034659603 |

** Clean up
#+begin_src sh :results output verbatim :var names=test-database-names
for name in $names; do
  echo "Deleting $name..."
  just psql --dbname=postgres <<< "drop database \"$name\""
done
#+end_src

#+results:
: Deleting bits_test_de521ad69a5c42f5a88a7b8034659603...
: DROP DATABASE
: Time: 42.318 ms
